InformationRegisters/бит_ИсторияЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>бит_ИсторияЗвонков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаписьРазговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЗвонка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Успешность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДлительностьЗвонка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НабранныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ИсторияЗвонков/Forms/ФормаПросмотраЗвонка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДлительностьЗвонка = бит_ТелефонияКлиентСервер.ФорматироватьДлительностьЗвонкаСЛидНулями(Запись.ДлительностьЗвонка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьРазговораНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	стрПутьКЗаписи = Запись.ЗаписьРазговора;
	Если ЗначениеЗаполнено(стрПутьКЗаписи) Тогда
		бит_БитфонКлиент.ВоспроизвестиЗаписьРазговора(стрПутьКЗаписи);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСсылкуВБуферОбмена(Команда)
	
	Если НЕ ЗначениеЗаполнено(Запись.ЗаписьРазговора) Тогда
		Возврат;
	КонецЕсли;
	
	objHTML = Новый COMОбъект("htmlfile");
	objHTML.ParentWindow.ClipboardData.SetData("text", Запись.ЗаписьРазговора);
КонецПроцедуры

&НаКлиенте
Процедура СкачатьЗапись(Команда)
	
	Если НЕ ЗначениеЗаполнено(Запись.ЗаписьРазговора) Тогда
		Возврат;
	КонецЕсли;
	
	данныеЗапись = Неопределено;
	загружено = бит_ТелефонияКлиент.СкачатьПоHTTPS(Запись.ЗаписьРазговора, 900, Ложь, данныеЗапись);
	
	Если загружено Тогда
		длг = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		длг.ПолноеИмяФайла = бит_ТелефонияКлиент.ПолучитьИмяФайлаЗаписиСДатой(Запись.Дата) + ".mp3"; 
		длг.Фильтр = "Файл mp3 (*.mp3)|*.mp3";
		бит_ТелефонияКлиентПереопределяемый.ПоказВыборФайла(длг, "БитИсторияЗвонков_СохранениеФайлаЗаписиРазговораЗавершение", данныеЗапись);
	Иначе
		бит_ТелефонияКлиент.ВывестиСообщение("Ошибка загрузки записи разговора", ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "БитИсторияЗвонков_СохранениеФайлаЗаписиРазговораЗавершение" Тогда
		Если ЗначениеЗаполнено(Параметр.Результат) Тогда
			данныеЗапись = Параметр.ПараметрОповещения;
			имяФайла = Параметр.Результат[0];
			данныеЗапись.Записать(имяФайла);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
